Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00100.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="PIC32CM2532LS00100" edc:arch="arm32bit" edc:procid="0x0000" atdf:architecture="CORTEX-M23" atdf:family="PIC32CM" edc:hasFreeze="false" edc:masksetid="SG003">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="1.62" edc:maxvoltage="3.63" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true">
    <edc:ProgrammingRowSize edc:progop="rowerase" edc:nzsize="256"/>
  </edc:Programming>
  <edc:ArchDef edc:name="arm32bit" edc:desc="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv8m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="-15" edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset"/>
    <edc:Interrupt edc:irq="-14" edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted"/>
    <edc:Interrupt edc:irq="-13" edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault"/>
    <edc:Interrupt edc:irq="-5" edc:cname="SVCall" edc:desc="System Service Call via SVC instruction"/>
    <edc:Interrupt edc:irq="-2" edc:cname="PendSV" edc:desc="Pendable request for system service"/>
    <edc:Interrupt edc:irq="-1" edc:cname="SysTick" edc:desc="System Tick Timer"/>
    <edc:Interrupt edc:irq="0" edc:cname="SYSTEM" edc:desc="System peripherals shared interrupt" ltx:memberofperipheral="MCLK OSCCTRL OSC32KCTRL PM SUPC"/>
    <edc:Interrupt edc:irq="1" edc:cname="WDT" edc:desc="Watchdog Timer" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:irq="2" edc:cname="RTC" edc:desc="Real Time Counter" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="3" edc:cname="EIC_EXTINT_0" edc:desc="External Channel 0" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="4" edc:cname="EIC_EXTINT_1" edc:desc="External Channel 1" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="5" edc:cname="EIC_EXTINT_2" edc:desc="External Channel 2" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="6" edc:cname="EIC_EXTINT_3" edc:desc="External Channel 3" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="7" edc:cname="EIC_EXTINT_4" edc:desc="External Channel 4" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="8" edc:cname="EIC_EXTINT_5" edc:desc="External Channel 5" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="9" edc:cname="EIC_EXTINT_6" edc:desc="External Channel 6" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="10" edc:cname="EIC_EXTINT_7" edc:desc="External Channel 7" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="11" edc:cname="EIC_OTHER" edc:desc="External Channel 8..X" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="12" edc:cname="FREQM" edc:desc="Frequency Meter" ltx:memberofperipheral="FREQM"/>
    <edc:Interrupt edc:irq="13" edc:cname="NVMCTRL" edc:desc="Non-Volatile Memory Controller" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:irq="14" edc:cname="PORT" edc:desc="Port Non-Secure Check" ltx:memberofperipheral="PORT"/>
    <edc:Interrupt edc:irq="15" edc:cname="DMAC_0" edc:desc="DMA Channel 0" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="16" edc:cname="DMAC_1" edc:desc="DMA Channel 1" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="17" edc:cname="DMAC_2" edc:desc="DMA Channel 2" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="18" edc:cname="DMAC_3" edc:desc="DMA Channel 3" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="19" edc:cname="DMAC_OTHER" edc:desc="DMA Channel 4..X" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="20" edc:cname="USB" edc:desc="Universal Serial Bus" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="21" edc:cname="EVSYS_0" edc:desc="Event System Channel 0" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="22" edc:cname="EVSYS_1" edc:desc="Event System Channel 1" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="23" edc:cname="EVSYS_2" edc:desc="Event System Channel 2" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="24" edc:cname="EVSYS_3" edc:desc="Event System Channel 3" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="25" edc:cname="EVSYS_4" edc:desc="Event System Channel 4" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="26" edc:cname="EVSYS_5" edc:desc="Event System Channel 5" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="27" edc:cname="EVSYS_6" edc:desc="Event System Channel 6" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="28" edc:cname="EVSYS_7" edc:desc="Event System Channel 7" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="29" edc:cname="EVSYS_NSCHK" edc:desc="Event System Non-Secure Check" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="30" edc:cname="PAC" edc:desc="Peripheral Access Controller" ltx:memberofperipheral="PAC"/>
    <edc:Interrupt edc:irq="31" edc:cname="SERCOM0_0" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="32" edc:cname="SERCOM0_1" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="33" edc:cname="SERCOM0_2" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="34" edc:cname="SERCOM0_OTHER" edc:desc="Serial Communication Interface 0" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="35" edc:cname="SERCOM1_0" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="36" edc:cname="SERCOM1_1" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="37" edc:cname="SERCOM1_2" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="38" edc:cname="SERCOM1_OTHER" edc:desc="Serial Communication Interface 1" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="39" edc:cname="SERCOM2_0" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="40" edc:cname="SERCOM2_1" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="41" edc:cname="SERCOM2_2" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="42" edc:cname="SERCOM2_OTHER" edc:desc="Serial Communication Interface 2" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="43" edc:cname="SERCOM3_0" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="44" edc:cname="SERCOM3_1" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="45" edc:cname="SERCOM3_2" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="46" edc:cname="SERCOM3_OTHER" edc:desc="Serial Communication Interface 3" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="47" edc:cname="SERCOM4_0" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="48" edc:cname="SERCOM4_1" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="49" edc:cname="SERCOM4_2" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="50" edc:cname="SERCOM4_OTHER" edc:desc="Serial Communication Interface 4" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="51" edc:cname="SERCOM5_0" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="52" edc:cname="SERCOM5_1" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="53" edc:cname="SERCOM5_2" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="54" edc:cname="SERCOM5_OTHER" edc:desc="Serial Communication Interface 5" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="55" edc:cname="TC0" edc:desc="Timer Counter 0" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="56" edc:cname="TC1" edc:desc="Timer Counter 1" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="57" edc:cname="TC2" edc:desc="Timer Counter 2" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="58" edc:cname="TCC0" edc:desc="TCC Match/Compare 0" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="59" edc:cname="TCC1" edc:desc="TCC Match/Compare 1" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="60" edc:cname="TCC2" edc:desc="TCC Match/Compare 2" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="61" edc:cname="TCC3" edc:desc="TCC Match/Compare 3" ltx:memberofperipheral="TCC3"/>
    <edc:Interrupt edc:irq="62" edc:cname="ADC_OTHER" edc:desc="Analog To Digital Converter" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:irq="63" edc:cname="ADC_RESRDY" edc:desc="ADC Result Ready" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:irq="64" edc:cname="AC" edc:desc="Analog Comparator" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:irq="65" edc:cname="DAC_UNDERRUN" edc:desc="Digital to Analog Converter" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="66" edc:cname="DAC_EMPTY" edc:desc="DAC Buffer 0 Empty" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="67" edc:cname="PTC" edc:desc="Peripheral Touch Controller" ltx:memberofperipheral="PTC"/>
    <edc:Interrupt edc:irq="68" edc:cname="TRNG" edc:desc="True Random Generator" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:irq="69" edc:cname="I2S" edc:desc="Inter-IC Sound Interface" ltx:memberofperipheral="I2S"/>
    <edc:Interrupt edc:irq="70" edc:cname="TRAM" edc:desc="Trust Ram" ltx:memberofperipheral="TRAM"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug" edc:desc=""/>
    <edc:Peripheral edc:cname="CoreDebug_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="DAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DIB" edc:desc=""/>
    <edc:Peripheral edc:cname="DIB_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="DWT" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="FPB" edc:desc=""/>
    <edc:Peripheral edc:cname="FREQM" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="I2S" edc:desc=""/>
    <edc:Peripheral edc:cname="ICB" edc:desc=""/>
    <edc:Peripheral edc:cname="ICB_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="IDAU" edc:desc=""/>
    <edc:Peripheral edc:cname="MCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="OPAMP" edc:desc=""/>
    <edc:Peripheral edc:cname="OSC32KCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OSCCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SCB" edc:desc=""/>
    <edc:Peripheral edc:cname="SCB_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick_NS" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TRAM" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R7" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="28"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R8" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="32"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R9" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="36"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R10" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="40"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R11" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="44"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R12" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="48"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="SP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Stack Pointer" edc:nmmrid="52"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP_S" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer Secure" edc:nmmrid="112"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP_NS" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer Non-secure" edc:nmmrid="104"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP_S" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer Secure" edc:nmmrid="116"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP_NS" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer Non-secure" edc:nmmrid="108"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer" edc:nmmrid="64"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer" edc:nmmrid="68"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="LR" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:desc="Link Register" edc:nmmrid="56"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PC" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Program Counter" edc:nmmrid="60"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSR" edc:impl="0xF10001FF" edc:access="nnnn---n---------------nnnnnnnnn" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Program Status Register" edc:nmmrid="72"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="APSR" edc:impl="0xF0000000" edc:access="nnnn----------------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Application Program Status Register" edc:nmmrid="76"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="IPSR" edc:impl="0x3F" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Interrupt Program Status Register" edc:nmmrid="80"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="EPSR" edc:impl="0x1000000" edc:access="-------r------------------------" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Execution Program Status Register" edc:nmmrid="84"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK_S" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register Secure" edc:nmmrid="508"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK_NS" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register Non-secure" edc:nmmrid="524"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register" edc:nmmrid="88"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL_S" edc:impl="0x3" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register Secure" edc:nmmrid="520"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL_NS" edc:impl="0x3" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register Non-secure" edc:nmmrid="536"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL" edc:impl="0x3" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register" edc:nmmrid="100"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSPLIM_S" edc:impl="0xFFFFFFF8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Process Stack Limit Pointer Register Secure" edc:nmmrid="132"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSPLIM_S" edc:impl="0xFFFFFFF8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Main Stack Limit Pointer Register Secure" edc:nmmrid="128"/>
    </edc:NMMRPlace>
    <edc:CodeSector edc:regionid="IFLASH" edc:beginaddr="0x0" edc:endaddr="0x40000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:CodeSector edc:regionid="DATAFLASH" edc:beginaddr="0x400000" edc:endaddr="0x402000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:UserZone edc:regionid="USER_PAGE" edc:beginaddr="0x804000" edc:endaddr="0x804100" atdf:pagesize="0x40" edc:rw="rw" edc:erasepagesize="0x100"/>
    <edc:ConfigFuseSector edc:regionid="USER_FUSES" edc:beginaddr="0x804000" edc:endaddr="0x804024" atdf:pagesize="0x40" edc:erasepagesize="0x100">
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_0" edc:nzwidth="0x20" edc:impl="0xFE00FFBF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xB08F4377" edc:access="nnnnnnn---------nnnnnnnnn-nnnnnn" edc:_addr="0x804000" edc:default="0xB08F4377">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NVMCTRL_SULCK" edc:nzwidth="0x3" edc:desc="NVM Secure Region Locks"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_NSULCK" edc:nzwidth="0x3" edc:desc="NVM Non-Secure Region Locks"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOD33USERLEVEL" edc:nzwidth="0x6" edc:desc="BOD33 User Level"/>
            <edc:DCRFieldDef edc:cname="BOD33_DIS" edc:nzwidth="0x1" edc:desc="BOD33 Disable">
