Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00100.PIC
      <edc:AdjustPoint edc:offset="0x3FF" edc:_addr="0x40000C01"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x40001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="TUNEEI" edc:nzwidth="0x1" edc:desc="Tune Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="TUNEINV" edc:nzwidth="0x1" edc:desc="Tune Event Input Invert"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001001"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="---nnnnn----nnnn-----nnn---n--nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F0F0713" edc:_addr="0x40001004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:nzwidth="0x1" edc:desc="OSC16M Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:nzwidth="0x1" edc:desc="DFLLULP Ready interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP No Lock Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Lock Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Loop Divider Ratio Update Complete Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="---nnnnn----nnnn-----nnn---n--nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F0F0713" edc:_addr="0x40001008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:nzwidth="0x1" edc:desc="OSC16M Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:nzwidth="0x1" edc:desc="DFLLULP Ready interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP No Lock Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Lock Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Loop Divider Ratio Update Complete Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="---nnnnn----nnnn-----nnn---n--nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F0F0713" edc:_addr="0x4000100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:nzwidth="0x1" edc:desc="OSC16M Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:nzwidth="0x1" edc:desc="DFLLULP Ready"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP Lock"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP No Lock"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Lock Timeout"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Loop Divider Ratio Update Complete"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="---rrrrr----rrrr-----rrr---r-rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F0F0717" edc:_addr="0x40001010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:nzwidth="0x1" edc:desc="XOSC Ready"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:nzwidth="0x1" edc:desc="XOSC Clock Failure Detector"/>
            <edc:SFRFieldDef edc:cname="XOSCCKSW" edc:nzwidth="0x1" edc:desc="XOSC Clock Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC16MRDY" edc:nzwidth="0x1" edc:desc="OSC16M Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DFLLULPRDY" edc:nzwidth="0x1" edc:desc="DFLLULP Ready"/>
            <edc:SFRFieldDef edc:cname="DFLLULPLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP Lock"/>
            <edc:SFRFieldDef edc:cname="DFLLULPNOLOCK" edc:nzwidth="0x1" edc:desc="DFLLULP No Lock"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:nzwidth="0x1" edc:desc="DPLL Lock Rise"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:nzwidth="0x1" edc:desc="DPLL Lock Fall"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:nzwidth="0x1" edc:desc="DPLL Lock Timeout"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:nzwidth="0x1" edc:desc="DPLL Loop Divider Ratio Update Complete"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:nzwidth="0x1" edc:desc="DFLL Ready"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:nzwidth="0x1" edc:desc="DFLL Out Of Bounds"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:nzwidth="0x1" edc:desc="DFLL Lock Fine"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:nzwidth="0x1" edc:desc="DFLL Lock Coarse"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:nzwidth="0x1" edc:desc="DFLL Reference Clock Stopped"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
