Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CSSELR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0xE000ED84">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="InD" edc:nzwidth="0x1" edc:desc="Instruction not Data"/>
            <edc:SFRFieldDef edc:cname="Level" edc:nzwidth="0x3" edc:desc="Cache level - 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE000ED88"/>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_TYPE" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0xE000ED90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:nzwidth="0x1" edc:desc="Separate instructions and data address regions"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:nzwidth="0x8" edc:desc="Number of MPU data regions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_CTRL" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0xE000ED94">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="MPU enable"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:nzwidth="0x1" edc:desc="HardFault, NMI enable"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:nzwidth="0x1" edc:desc="Privileged default enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_RNR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE000ED98">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x8" edc:desc="Selected region number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_RBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000ED9C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x2" edc:desc="Access permissions">
              <edc:SFRFieldSemantic edc:cname="RWPRIV" edc:desc="Read/write by privileged code only" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RWANY" edc:desc="Read/write by any privilege level" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPRIV" edc:desc="Read-only by privileged code only" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RANY" edc:desc="Read-only by any privilege level" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SH" edc:nzwidth="0x2" edc:desc="Shareability">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-shareable" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTER" edc:desc="Outer shareable" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="INNER" edc:desc="Inner shareable" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BASE" edc:nzwidth="0x1B" edc:desc="Base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_RLAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnn-nnnn" edc:impl="0xFFFFFFEF" edc:_addr="0xE000EDA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Region enable"/>
            <edc:SFRFieldDef edc:cname="AttrInd" edc:nzwidth="0x3" edc:desc="Attribute Index"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LIMIT" edc:nzwidth="0x1B" edc:desc="Limit address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0xE000EDA4"/>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_MAIR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EDC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="Attr0" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 0"/>
            <edc:SFRFieldDef edc:cname="Attr1" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 1"/>
            <edc:SFRFieldDef edc:cname="Attr2" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 2"/>
            <edc:SFRFieldDef edc:cname="Attr3" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="MPU_MAIR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EDC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="Attr4" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 4"/>
            <edc:SFRFieldDef edc:cname="Attr5" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 5"/>
            <edc:SFRFieldDef edc:cname="Attr6" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 6"/>
            <edc:SFRFieldDef edc:cname="Attr7" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x28" edc:_addr="0xE000EDC8"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DHCSR" edc:nzwidth="0x20" edc:access="-----nnn---nnnnn----------n-nnnn" edc:impl="0x71F002F" edc:_addr="0xE000EDF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:nzwidth="0x1" edc:desc="Enable Halting debug"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:nzwidth="0x1" edc:desc="Halt processor"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:nzwidth="0x1" edc:desc="Enable single step"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:nzwidth="0x1" edc:desc="Mask PendSV, SysTick and external configurable interrupts"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SNAPSTALL" edc:nzwidth="0x1" edc:desc="Snap stall control"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="S_REGRDY" edc:nzwidth="0x1" edc:desc="Register ready status"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:nzwidth="0x1" edc:desc="Halted status"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:nzwidth="0x1" edc:desc="Sleeping status"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:nzwidth="0x1" edc:desc="Lockup status"/>
            <edc:SFRFieldDef edc:cname="S_SDE" edc:nzwidth="0x1" edc:desc="Secure debug enabled"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:nzwidth="0x1" edc:desc="Retire sticky status"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:nzwidth="0x1" edc:desc="Reset sticky status"/>
            <edc:SFRFieldDef edc:cname="S_RESTART_ST" edc:nzwidth="0x1" edc:desc="Restart sticky status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
