Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="SCB_NS" edc:cname="CCSIDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE002ED80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB_NS">
            <edc:SFRFieldDef edc:cname="LineSize" edc:nzwidth="0x3" edc:desc="log2(number of words per line) - 2"/>
            <edc:SFRFieldDef edc:cname="Associativity" edc:nzwidth="0xA" edc:desc="Associativity - 1"/>
            <edc:SFRFieldDef edc:cname="NumSets" edc:nzwidth="0xF" edc:desc="Number of sets - 1"/>
            <edc:SFRFieldDef edc:cname="WA" edc:nzwidth="0x1" edc:desc="Write-Allocate"/>
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x1" edc:desc="Read-Allocate"/>
            <edc:SFRFieldDef edc:cname="WB" edc:nzwidth="0x1" edc:desc="Write-Back"/>
            <edc:SFRFieldDef edc:cname="WT" edc:nzwidth="0x1" edc:desc="Write-Through"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB_NS" edc:cname="CSSELR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0xE002ED84">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB_NS">
            <edc:SFRFieldDef edc:cname="InD" edc:nzwidth="0x1" edc:desc="Instruction not Data"/>
            <edc:SFRFieldDef edc:cname="Level" edc:nzwidth="0x3" edc:desc="Cache level - 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE002ED88"/>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_TYPE" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0xE002ED90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:nzwidth="0x1" edc:desc="Separate instructions and data address regions"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:nzwidth="0x8" edc:desc="Number of MPU data regions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_CTRL" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0xE002ED94">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="MPU enable"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:nzwidth="0x1" edc:desc="HardFault, NMI enable"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:nzwidth="0x1" edc:desc="Privileged default enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_RNR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0xE002ED98">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="REGION" edc:nzwidth="0x8" edc:desc="Selected region number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_RBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002ED9C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="XN" edc:nzwidth="0x1" edc:desc="Execute Never"/>
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x2" edc:desc="Access permissions">
              <edc:SFRFieldSemantic edc:cname="RWPRIV" edc:desc="Read/write by privileged code only" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RWANY" edc:desc="Read/write by any privilege level" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPRIV" edc:desc="Read-only by privileged code only" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RANY" edc:desc="Read-only by any privilege level" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SH" edc:nzwidth="0x2" edc:desc="Shareability">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-shareable" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTER" edc:desc="Outer shareable" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="INNER" edc:desc="Inner shareable" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BASE" edc:nzwidth="0x1B" edc:desc="Base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_RLAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnn-nnnn" edc:impl="0xFFFFFFEF" edc:_addr="0xE002EDA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Region enable"/>
            <edc:SFRFieldDef edc:cname="AttrInd" edc:nzwidth="0x3" edc:desc="Attribute Index"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LIMIT" edc:nzwidth="0x1B" edc:desc="Limit address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0xE002EDA4"/>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_MAIR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002EDC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="Attr0" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 0"/>
            <edc:SFRFieldDef edc:cname="Attr1" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 1"/>
            <edc:SFRFieldDef edc:cname="Attr2" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 2"/>
            <edc:SFRFieldDef edc:cname="Attr3" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MPU_NS" edc:cname="MPU_NS_MAIR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002EDC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="Attr4" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 4"/>
            <edc:SFRFieldDef edc:cname="Attr5" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 5"/>
            <edc:SFRFieldDef edc:cname="Attr6" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 6"/>
            <edc:SFRFieldDef edc:cname="Attr7" edc:nzwidth="0x8" edc:desc="Attribute of MPU region 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x28" edc:_addr="0xE002EDC8"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug_NS" edc:cname="DHCSR" edc:nzwidth="0x20" edc:access="-----nnn---nnnnn----------n-nnnn" edc:impl="0x71F002F" edc:_addr="0xE002EDF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:nzwidth="0x1" edc:desc="Enable Halting debug"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:nzwidth="0x1" edc:desc="Halt processor"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:nzwidth="0x1" edc:desc="Enable single step"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:nzwidth="0x1" edc:desc="Mask PendSV, SysTick and external configurable interrupts"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SNAPSTALL" edc:nzwidth="0x1" edc:desc="Snap stall control"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="S_REGRDY" edc:nzwidth="0x1" edc:desc="Register ready status"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:nzwidth="0x1" edc:desc="Halted status"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:nzwidth="0x1" edc:desc="Sleeping status"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:nzwidth="0x1" edc:desc="Lockup status"/>
            <edc:SFRFieldDef edc:cname="S_SDE" edc:nzwidth="0x1" edc:desc="Secure debug enabled"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:nzwidth="0x1" edc:desc="Retire sticky status"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:nzwidth="0x1" edc:desc="Reset sticky status"/>
            <edc:SFRFieldDef edc:cname="S_RESTART_ST" edc:nzwidth="0x1" edc:desc="Restart sticky status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug_NS" edc:cname="DCRSR" edc:nzwidth="0x20" edc:access="---------------w---------wwwwwww" edc:impl="0x1007F" edc:_addr="0xE002EDF4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:nzwidth="0x7" edc:desc="Register selector"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:nzwidth="0x1" edc:desc="Register write/not-read access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE002EDF8"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug_NS" edc:cname="DEMCR" edc:nzwidth="0x20" edc:access="-------n---nnnnn----nnnnnnnn---n" edc:impl="0x11F0FF1" edc:_addr="0xE002EDFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:nzwidth="0x1" edc:desc="Core reset Halting debug vector catch enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:nzwidth="0x1" edc:desc="MemManage exception Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:nzwidth="0x1" edc:desc="UsageFault exception coprocessor access Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:nzwidth="0x1" edc:desc="UsageFault exception checking error Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:nzwidth="0x1" edc:desc="UsageFault exception state information error Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:nzwidth="0x1" edc:desc="BusFault exception Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:nzwidth="0x1" edc:desc="Excception entry and return faults Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:nzwidth="0x1" edc:desc="HardFault exception Halting debug vector catch enable"/>
            <edc:SFRFieldDef edc:cname="VC_SFERR" edc:nzwidth="0x1" edc:desc="SecureFault exception Halting debug vector catch enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:nzwidth="0x1" edc:desc="DebugMonitor enable"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:nzwidth="0x1" edc:desc="DebugMonitor pending state"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:nzwidth="0x1" edc:desc="Enable DebugMonitor stepping"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:nzwidth="0x1" edc:desc="DebugMonitor semaphore bit"/>
            <edc:SFRFieldDef edc:cname="SDME" edc:nzwidth="0x1" edc:desc="Secure DebugMonitor enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:nzwidth="0x1" edc:desc="Global DWT and ITM features enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE002EE00"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug_NS" edc:cname="DAUTHCTRL" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0xE002EE04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="SPIDENSEL" edc:nzwidth="0x1" edc:desc="Secure invasive debug enable select"/>
            <edc:SFRFieldDef edc:cname="INTSPIDEN" edc:nzwidth="0x1" edc:desc="Internal Secure invasive debug enable"/>
            <edc:SFRFieldDef edc:cname="SPNIDENSEL" edc:nzwidth="0x1" edc:desc="Secure non-invasive debug enable select"/>
            <edc:SFRFieldDef edc:cname="INTSPNIDEN" edc:nzwidth="0x1" edc:desc="Internal Secure non-invasive debug enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug_NS" edc:cname="DSCSR" edc:nzwidth="0x20" edc:access="--------------nn--------------nn" edc:impl="0x30003" edc:_addr="0xE002EE08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="SBRSELEN" edc:nzwidth="0x1" edc:desc="Secure Banked register select enable"/>
            <edc:SFRFieldDef edc:cname="SBRSEL" edc:nzwidth="0x1" edc:desc="Secure Banked register select"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="CDS" edc:nzwidth="0x1" edc:desc="Current domain Secure"/>
            <edc:SFRFieldDef edc:cname="CDSKEY" edc:nzwidth="0x1" edc:desc="CDS field write-enable key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1A4" edc:_addr="0xE002EE0C"/>
      <edc:SFRDef ltx:memberofperipheral="DIB_NS" edc:cname="DLAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE002EFB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x20" edc:desc="Lock access control">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB_NS" edc:cname="DLSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE002EFB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="SLI" edc:nzwidth="0x1" edc:desc="Software Lock implemented"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:nzwidth="0x1" edc:desc="Software Lock status"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:nzwidth="0x1" edc:desc="Not thirty-two bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB_NS" edc:cname="DAUTHSTATUS" edc:nzwidth="0x20" edc:access="------------------------rrrr-r-r" edc:impl="0xF5" edc:_addr="0xE002EFB8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="NSID" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-secure invasive debug prohibited" edc:when="(field &amp; 0x1) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Non-secure invasive debug allowed" edc:when="(field &amp; 0x1) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NSNID" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-secure non-invasive debug prohibited" edc:when="(field &amp; 0x1) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Non-secure non-invasive debug allowed" edc:when="(field &amp; 0x1) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SNID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure non-invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure non-invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB_NS" edc:cname="DDEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000111011100000010101000000100" edc:mclr="01000111011100000010101000000100" edc:_addr="0xE002EFBC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:nzwidth="0xC" edc:desc="Architecture Part"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:nzwidth="0x4" edc:desc="Architecture Version"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:nzwidth="0x1" edc:desc="DEVARCH Present"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:nzwidth="0xB" edc:desc="Architect"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0xE002EFC0"/>
      <edc:SFRDef ltx:memberofperipheral="DIB_NS" edc:cname="DDEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0xE002EFCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:nzwidth="0x4" edc:desc="Major type"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:nzwidth="0x4" edc:desc="Sub-type"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DIB_NS" edc:cname="DPIDR4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE002EFD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="DES_2" edc:nzwidth="0x4" edc:desc="JEP106 continuation code"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
