Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00100.PIC
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSCLR4" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x4100A184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Clear"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Clear"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Clear"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Clear"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Clear"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSSET4" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x4100A185">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Set"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Set"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Set"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Set"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Set"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUS4" edc:nzwidth="0x8" edc:access="rrrr-rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x4100A186">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle Out"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle In"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 ready"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTFLAG4" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x4100A187">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/out"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/out"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTENCLR4" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x4100A188">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/Out Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/Out Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTENSET4" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x4100A189">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/out Interrupt enable"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/out Interrupt enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPCFG5" edc:nzwidth="0x8" edc:access="-nnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x77" edc:addr="0x4100A1A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:nzwidth="0x3" edc:desc="End Point Type0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:nzwidth="0x3" edc:desc="End Point Type1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSCLR5" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x4100A1A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Clear"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Clear"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Clear"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Clear"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Clear"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
